In [1]:
import pandas as pd
import random

### DataFrame

In [2]:
city = ['Moscow', 'Ekb', 'St.-Petersburg', 'Noginsk']
name = ['Kate', 'Julia', 'Victoria', 'Alexa']
mark = []

In [3]:
for i in range(4):
    mark.append(random.randint(2, 5))

In [4]:
mark

[5, 5, 4, 2]

In [5]:
my_frame = pd.DataFrame({'city': city, 'name': name, 'mark': mark})

In [6]:
my_frame

             city      name  mark
0          Moscow      Kate     5
1             Ekb     Julia     5
2  St.-Petersburg  Victoria     4
3         Noginsk     Alexa     2

In [7]:
frame = pd.DataFrame({'Numbers': range(10), 'Chars': ['a']*10})

In [8]:
frame

   Numbers Chars
0        0     a
1        1     a
2        2     a
3        3     a
4        4     a
5        5     a
6        6     a
7        7     a
8        8     a
9        9     a

In [9]:
frame = pd.read_csv('dataset.tsv', sep = '\t', header = 0)

In [10]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [11]:
frame.columns

Index(['Name', 'Birth', 'City', 'Position'], dtype='object')

In [12]:
frame.shape

(6, 4)

In [13]:
frame.dtypes

Name        object
Birth       object
City        object
Position    object
dtype: object

In [14]:
newline = {'Name': 'Логинова М.В.', 'Birth': '01.01.2001', 'City': 'Moscow', 'Position': 'Junior'}

In [31]:
# append добавляет строку, но не изменяет сам frame, поэтому необходимо присвоить фрейму frame.append
frame = frame.append(newline, ignore_index=True)

In [32]:
frame.shape

(8, 4)

In [33]:
frame.loc[6]

Name        Логинова М.В.
Birth          01.01.2001
City               Moscow
Position           Junior
Name: 6, dtype: object

In [36]:
# axis=0 строка, axis=1 столбец
frame.drop([6], axis=0, inplace = True)

In [37]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [38]:
# перевод даты в datetime
frame.Birth = frame.Birth.apply(pd.to_datetime)

In [39]:
frame

              Name      Birth       City  Position
0      Иванов А.А. 1980-03-22     Москва       NaN
1     Сорокин И.В. 1965-07-08  Волгоград   инженер
2       Белов М.М. 1980-02-13     Ростов  менеджер
3  Мельникова Д.С. 1985-04-15     Ростов       NaN
4      Рыбина Е.П. 1985-11-19     Москва   инженер
5     Костров С.О. 1985-05-31     Москва    стажер

In [ ]:
frame.dtypes

Name                object
Birth       datetime64[ns]
City                object
Position            object
dtype: object

In [ ]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Birth     6 non-null      datetime64[ns]
 2   City      6 non-null      object
 3   Position  4 non-null      object
dtypes: datetime64[ns](1), object(3)
memory usage: 320.0+ bytes

In [ ]:
# заполняем NaN значением Разнорабочий
frame.fillna('Разнорабочий', inplace = True)

In [ ]:
frame

              Name      Birth       City      Position
0      Иванов А.А. 1980-03-22     Москва  Разнорабочий
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
2       Белов М.М. 1980-02-13     Ростов      менеджер
3  Мельникова Д.С. 1985-04-15     Ростов  Разнорабочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5     Костров С.О. 1985-05-31     Москва        стажер

In [ ]:
frame.Position

0    Разнорабочий
1         инженер
2        менеджер
3    Разнорабочий
4         инженер
5          стажер
Name: Position, dtype: object

In [ ]:
frame['Position']

0    Разнорабочий
1         инженер
2        менеджер
3    Разнорабочий
4         инженер
5          стажер
Name: Position, dtype: object

In [ ]:
frame[frame['Position'] == 'инженер']

           Name      Birth       City Position
1  Сорокин И.В. 1965-07-08  Волгоград  инженер
4   Рыбина Е.П. 1985-11-19     Москва  инженер

### Вывод строк

In [ ]:
frame.head(4)

              Name      Birth       City      Position
0      Иванов А.А. 1980-03-22     Москва  Разнорабочий
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
2       Белов М.М. 1980-02-13     Ростов      менеджер
3  Мельникова Д.С. 1985-04-15     Ростов  Разнорабочий

In [ ]:
frame[:3]

           Name      Birth       City      Position
0   Иванов А.А. 1980-03-22     Москва  Разнорабочий
1  Сорокин И.В. 1965-07-08  Волгоград       инженер
2    Белов М.М. 1980-02-13     Ростов      менеджер

In [ ]:
frame[-3:]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  Разнорабочий
4      Рыбина Е.П. 1985-11-19  Москва       инженер
5     Костров С.О. 1985-05-31  Москва        стажер

### Метод loc работает с именами

In [ ]:
frame.loc[[1,4,5], ['Birth']]

       Birth
1 1965-07-08
4 1985-11-19
5 1985-05-31

### Метод iloc работает с индексами

In [ ]:
frame.iloc[[1,4,5], [1]]

       Birth
1 1965-07-08
4 1985-11-19
5 1985-05-31

### Метод ix работает и с именами, и с индексами

In [ ]:
frame.ix[[1,4,5], ['Birth']]

In [ ]:
from datetime import datetime

In [ ]:
frame[frame.Birth >= pd.datetime(1985,1,1)]

/var/folders/71/7vhtpz0s4pgdwwjv0y1tycdh0000gn/T/ipykernel_79816/2296076850.py:1: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  frame[frame.Birth >= pd.datetime(1985,1,1)]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  Разнорабочий
4      Рыбина Е.П. 1985-11-19  Москва       инженер
5     Костров С.О. 1985-05-31  Москва        стажер

### Пересечение условий (логическое И)

In [ ]:
frame[(frame.Birth >= pd.datetime(1985,1,1)) & (frame.City != 'Москва')]

/var/folders/71/7vhtpz0s4pgdwwjv0y1tycdh0000gn/T/ipykernel_79816/902286102.py:1: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  frame[(frame.Birth >= pd.datetime(1985,1,1)) & (frame.City != 'Москва')]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  Разнорабочий

### Объединение условий (логическое ИЛИ)

In [ ]:
frame[(frame.Birth >= pd.datetime(1985,1,1)) | (frame.City != 'Москва')]

/var/folders/71/7vhtpz0s4pgdwwjv0y1tycdh0000gn/T/ipykernel_79816/1752476060.py:1: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  frame[(frame.Birth >= pd.datetime(1985,1,1)) | (frame.City != 'Москва')]

              Name      Birth       City      Position
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
2       Белов М.М. 1980-02-13     Ростов      менеджер
3  Мельникова Д.С. 1985-04-15     Ростов  Разнорабочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5     Костров С.О. 1985-05-31     Москва        стажер

#### Сохранение датафрейма в csv

In [40]:
frame.to_csv('NewDataset.csv', sep = ',', header = True, index = None)

In [41]:
!cat NewDataset.csv

Name,Birth,City,Position
Иванов А.А.,1980-03-22,Москва,
Сорокин И.В.,1965-07-08,Волгоград,инженер
Белов М.М.,1980-02-13,Ростов,менеджер
Мельникова Д.С.,1985-04-15,Ростов,
Рыбина Е.П.,1985-11-19,Москва,инженер
Костров С.О.,1985-05-31,Москва,стажер